src/Catalogs/Кино.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>Кино</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГодВыпуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодОкончания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодIMDB</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКинопоиск</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСезонов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОригинальноеНазвание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКино</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Просмотрен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Жанры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Жанр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Жанры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Серии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СезонСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сезон</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыходаСерии</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазваниеСерии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Просмотрена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Страны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Страны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Кино/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)		
	
	Если Константы.СкрыватьПросмотренныеСерии.Получить() Тогда
		ФильтрПросмотр = 2;
		Элементы.НеПросмотренные.Пометка = Истина;
	Иначе
		ФильтрПросмотр = 0; 
		Элементы.БезФильтра.Пометка = Истина;
	КонецЕсли;	
	
	УстановитьПараметрДинамисческогоСписка(); 
	
	Пароль = Константы.ПарольДляВхода.Получить();
	Если НЕ Пароль = "" Тогда
		ВходПоПаролю = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Жанры(Команда)
	ОткрытьФорму("Справочник.Жанры.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Страны(Команда)
	ОткрытьФорму("Справочник.Страны.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	ОткрытьФорму("ОбщаяФорма.Настройки");
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрДинамисческогоСписка()
	Список.Параметры.УстановитьЗначениеПараметра("ФильтрПросмотр", ФильтрПросмотр); 
	Список.Параметры.УстановитьЗначениеПараметра("Тип", Тип);
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПросмотренныеПриИзменении(Элемент)
	УстановитьПараметрДинамисческогоСписка();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ВходПоПаролю Тогда 
		ОткрытьФорму("ОбщаяФорма.ВходПоПаролю",,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипОтборПриИзменении(Элемент)
	УстановитьПараметрДинамисческогоСписка();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(,ВыбраннаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура Просмотренные(Команда)
	ФильтрПросмотр = 1;
	УстановитьПараметрДинамисческогоСписка();
	Элементы.Просмотренные.Пометка = Истина;
	Элементы.НеПросмотренные.Пометка = Ложь;
	Элементы.БезФильтра.Пометка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура НеПросмотренные(Команда)
	ФильтрПросмотр = 2;
	УстановитьПараметрДинамисческогоСписка();
	Элементы.Просмотренные.Пометка = Ложь;
	Элементы.НеПросмотренные.Пометка = Истина;
	Элементы.БезФильтра.Пометка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура БезФильтра(Команда)
	ФильтрПросмотр = 0;
	УстановитьПараметрДинамисческогоСписка();
	Элементы.Просмотренные.Пометка = Ложь;
	Элементы.НеПросмотренные.Пометка = Ложь;
	Элементы.БезФильтра.Пометка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЖанрыНажатие(Элемент)
	ОткрытьФорму("Справочник.Жанры.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура СтраныНажатие(Элемент)
	ОткрытьФорму("Справочник.Страны.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура НастройкиНажатие(Элемент)
	ОткрытьФорму("ОбщаяФорма.Настройки");
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	ТС = Элементы.Список.ТекущаяСтрока;
	Если НЕ ТС = Неопределено Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект,ТС), "Удалить """ + Строка(ТС) + """?", РежимДиалогаВопрос.ДаНет,,,"Удаление");	 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, Ссылка) Экспорт	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда		
		УдалитьСервер(Ссылка);
		Элементы.Список.Обновить();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УдалитьСервер(Ссылка) 
	ОБ = Ссылка.ПолучитьОбъект();
	ОБ.Удалить();	
КонецПроцедуры
